app/views/events/show.html.haml

  %tbody
  - @event.tables.each do |table|
---
SELECT "tables".* FROM "tables"  WHERE "tables"."event_id" = ?  [["event_id", 1]]