app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "event_name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-08 02:22:30.555978"], ["event_name", "New"], ["updated_at", "2014-07-08 02:22:30.555978"]]
---
  def create
    @event = Event.new(permitted_params.event)

    if @event.save