app/controllers/seats_controller.rb

SELECT  "tables".* FROM "tables"  WHERE "tables"."id" = ? LIMIT 1  [["id", 1]]
SELECT "seats".* FROM "seats"  WHERE "seats"."table_id" IS NULL
---
  def index
    @tables = Table.find(params[:table_id])
    @seats = Seat.where(:table => @tables)